app/controllers/leaderboards_controller.rb

SELECT "players".* FROM "players" ORDER BY "players"."wins" DESC, "players"."losses" ASC, "players"."name" ASC
---
  def index
    @players = Player.order(wins: :desc, losses: :asc, name: :asc)