app/controllers/matches_controller.rb

SELECT "matches".* FROM "matches" ORDER BY "matches"."played_at" DESC
---
  def index
    @matches = Match.order(played_at: :desc)

SELECT "matches".* FROM "matches" WHERE "matches"."id" = 5 LIMIT 1
---
  def show
    @match = Match.find(params[:id])

SELECT "players".* FROM "players" ORDER BY "players"."name" ASC
---
  def new
    @match = Match.new
    @players = Player.order(:name)

INSERT INTO "matches" ("created_at", "loser_id", "played_at", "player_a_id", "player_b_id", "score", "updated_at", "winner_id") VALUES ('2025-12-01 11:46:44.688514', 2, NULL, 3, 2, '21-16,21-19', '2025-12-01 11:46:44.688514', 3) RETURNING "id"
SELECT "players".* FROM "players" ORDER BY "players"."name" ASC
---
  def create
    @match = Match.new(match_params)

    # set the loser from the chosen winner
    if @match.winner_id == @match.player_a_id
      @match.loser_id = @match.player_b_id
    else
      @match.loser_id = @match.player_a_id
    end

    ActiveRecord::Base.transaction do
      if @match.save
        # success: redirect (Turbo accepts redirects)
        redirect_to matches_path, notice: 'Match recorded'
      else
        # failure: render the form again with 422 so Turbo will accept it
        @players = Player.order(:name)

SELECT "matches".* FROM "matches" WHERE "matches"."id" = 5 LIMIT 1
UPDATE "players" SET "wins" = COALESCE("players"."wins", 0) - 1 WHERE "players"."id" = 3
UPDATE "players" SET "losses" = COALESCE("players"."losses", 0) - 1 WHERE "players"."id" = 5
DELETE FROM "matches" WHERE "matches"."id" = 5
---
  def destroy
    @match = Match.find(params[:id])

    Player.decrement_counter(:wins, @match.winner_id)
    Player.decrement_counter(:losses, @match.loser_id)
    @match.destroy