app/controllers/players_controller.rb

  def index
    @players = Player.order(wins: :desc, losses: :asc, name: :asc)
---
SELECT "players".* FROM "players" ORDER BY "players"."wins" DESC, "players"."losses" ASC, "players"."name" ASC

  def create
    @player = Player.new(player_params)
    if @player.save
---
INSERT INTO "players" ("name", "email", "wins", "losses", "created_at", "updated_at") VALUES ('Aadithya', '', 0, 0, '2025-12-01 10:12:12.892717', '2025-12-01 10:12:12.892717') RETURNING "id"

  def update
    @player = Player.find(params[:id])
    if @player.update(player_params)
---
SELECT "players".* FROM "players" WHERE "players"."id" = 1 LIMIT 1
UPDATE "players" SET "name" = 'Aadithya.', "updated_at" = '2025-12-01 10:46:58.942678' WHERE "players"."id" = 5

  def edit
    @player = Player.find(params[:id])
---
SELECT "players".* FROM "players" WHERE "players"."id" = 1 LIMIT 1

  def destroy
    puts "debug: ==> destroy"
    @player = Player.find(params[:id])

    if player_has_matches?(@player)
      puts "before delete validation...."
      redirect_to players_path, alert: "Cannot delete player because there are matches referencing this player. Delete or reassign those matches first."
    else
      @player.destroy
---
SELECT "players".* FROM "players" WHERE "players"."id" = 7 LIMIT 1
DELETE FROM "players" WHERE "players"."id" = 7

  def player_has_matches?(player)
    Match.where(
      "player_a_id = :id OR player_b_id = :id OR winner_id = :id OR loser_id = :id",
      id: player.id
    ).exists?
---
SELECT 1 AS one FROM "matches" WHERE (player_a_id = 6 OR player_b_id = 6 OR winner_id = 6 OR loser_id = 6) LIMIT 1