app/models/match.rb

UPDATE "players" SET "wins" = COALESCE("players"."wins", 0) + 1 WHERE "players"."id" = 3
UPDATE "players" SET "losses" = COALESCE("players"."losses", 0) + 1 WHERE "players"."id" = 5
---
  def increment_counters
    Player.increment_counter(:wins, winner_id)
    Player.increment_counter(:losses, loser_id)